{
  "basics": {
    "gravatarUrl": "//www.gravatar.com/avatar/3dc66e090945740d88cf86daeb06f9e1.jpg",
    "profiles": [{
      "network": "Contact",
      "username": "ryexley",
      "url": "#contact-details",
      "tooltip": "Contact Details"
    }, {
      "network": "Twitter",
      "username": "ryexley",
      "url": "https://twitter.com/ryexley",
      "tooltip": "Follow me on Twitter"
    }, {
      "network": "GitHub",
      "username": "ryexley",
      "url": "https://github.com/ryexley",
      "tooltip": "My GitHub Profile"
    }]
  },
  "openSource": [{
    "projectName": "Poplar",
    "url": "https://github.com/ryexley/poplar",
    "description": "This project is an Electron menubar application for MacOS that I built for use in controlling a Wemo power outlet for turning a light on and off from my laptop. It's build with Electron, React and Redux."
  }, {
    "projectName": "Decked Out Workout",
    "url": "https://deckedoutworkout.com",
    "description": "React/Redux web application optimized for mobile devices for facilitating a quick-and-easy workout from anywhere you are when you have time. Code walkthrough available upon request."
  }, {
    "projectName": "This Resume",
    "url": "https://github.com/ryexley/ryexley.github.io",
    "description": "The code that generates this resume. I like to use this project as a sandbox to try various tools and techniques, and as an example of how I typically organize my code (although this is really an overly simplistic example). It's a simple node.js script that uses React components for each distinct section of the resume to generate a static HTML view. The CSS is modularized and processed with PostCSS and takes advantage of a number of advanced CSS3 techniques for styling a view that is responsive and easy to view from any device. A single JavaScript module handles page initialization, some on-page navigation and toggling the visibility of older work history elements. The entire thing is driven by a JSON Resume Schema compliant document, merged with an additional JSON document that adds some enhanced data beyond what the schema supports for customization. Editing and maintenance is simple, started with npm (which just launches a Gulp watch task), and updates to any file are reflected immediately in-browser with the use of BrowserSync."
  }, {
    "projectName": "Quakie",
    "url": "https://github.com/ryexley/quakie",
    "description": "This was a fun project that gave me a great opportunity to get more comfortable with some tools I was interested in expanding my knowledge of. There is a node.js script that iterates over a series of dates and downloads historical weather data and persists it to a Postgres database. With all of the historical weather data I was interested in persisted locally, I created a web UI with React, Webpack, postal.js, express.js, axios and Massive.js to extract the data from the database and generate graphs with weather trends using Chart.js."
  }, {
    "projectName": "Sycamore",
    "url": "https://github.com/ryexley/sycamore",
    "description": "A JavaScript mixin that simplifies the organization and execution of jQuery `$.ajax` calls."
  }, {
    "projectName": "Sumac",
    "url": "https://github.com/ryexley/sumac",
    "description": "A JavaScript mixin that extends a module with postal.js messaging functionality. Supports both publishing and subscribing functions, as well as a simple messages and subscriptions configuration syntax."
  }, {
    "projectName": "Various others",
    "url": "https://github.com/ryexley",
    "description": "I have a number of others in various states of relevancy and completion. Some are no longer in use or are outdated by now, and others are the product of learning new tools and techniques, and never really got completely \"finished.\" You know how it goes, right? ;-) Feel free to poke around in them anyway."
  }],
  "background": "After graduating from high school, I served for eleven years in the U.S. Air Force: the first six years as a Munitions Systems Specialist and the last five years as a Communications Computer System Programmer. Some of the assignments I served at included George Air Force Base (AFB) in southeastern California, Spangdahlem Air Base (AB), Germany, Prince Sultan AB, Saudi Arabia, Davis Monthan AFB in Tucson, Arizona and Wright-Patterson AFB in Dayton, Ohio. I separated from the Air Force in December of 2001 and have worked as a software developer ever since."
}
