{
  "basics": {
    "name": "Bob Yexley",
    "label": "Front End Web and Distributed Software Developer",
    "picture": "",
    "email": "bob@yexley.net",
    "phone": "(865) 399-3696",
    "website": "http://bob.yexley.net",
    "summary": "Family-first husband and father of two boys, I believe a good work-life balance is essential to maintaining the focus and productivity needed to achieve great results. I believe in using the right tool to get the job done in the most effective and efficient manner possible. In my 15+ years of experience, that has involved the use of various tools and platforms, but most recently my focus and specialization has been on native front-end web application development using HTML5, CSS3 and JavaScript connecting to flexible and powerful REST and microservices on the server. I'm passionate about delivering high-quality, user-friendly solutions that deliver business value to my customers and clients on the most ubiquitous and accessible platform available to them: the web.",
    "location": {
      "city": "Knoxville",
      "countryCode": "TN",
      "region": "East Tennessee"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Sparkbox",
      "position": "Web Developer",
      "website": "https://seesparkbox.com",
      "startDate": "January 2018",
      "endDate": "Present",
      "keywords": ["JavaScript", "HTML5", "CSS3", "React", "node.js", "Git", "GitHub"],
      "summary": "Web Developer specializing in working with clients to build web responsive and accessible web sites and applications with a focus on moving the web forward by building it a better way.",
      "highlights": [
        "Working primarily with a major retail client on improving their ecommerce platform performance by converting it to an improved component-based architecture using React."
      ]
    },
    {
      "company": "LeanKit",
      "position": "Senior Web Developer",
      "website": "http://leankit.com",
      "startDate": "September 2015",
      "endDate": "December 2017",
      "keywords": ["JavaScript", "HTML5", "CSS3", "React", "Flux", "node.js", "Git", "GitHub"],
      "summary": "Working on maintaining the company's flagship Lean/Kanban project management product"
    },
    {
      "company": "Lampo Group",
      "position": "Senior JavaScript Engineer (contractor)",
      "website": "http://daveramsey.com",
      "startDate": "November 2014",
      "endDate": "September 2015",
      "keywords": ["JavaScript", "HTML5", "CSS3", "SASS", "React", "Webpack", "Ruby on Rails", "node.js", "Git", "GitHub"],
      "summary": "Contracted for Ramsey Solutions as a front-end web developer helping build the SmartDollar site and application. We applied responsive design methodologies to make applications available in web browsers on any device.",
      "highlights": [
        "Designed and implemented a solution for modular JavaScript for the SmartDollar application using vanilla JavaScript and namespacing",
        "Designed and implemented a reporting application with React and my own implement of Flux using postal.js and the Chartist library for custom charts and graphs"
      ]
    },
    {
      "company": "appendTo",
      "position": "Senior JavaScript Engineer and Team Lead",
      "website": "",
      "startDate": "December 2012",
      "endDate": "October 2014",
      "keywords": ["JavaScript", "HTML5", "CSS3", "SASS", "Compass", "Knockout.js", "Backbone.js", "Cordova", "Git", "GitHub"],
      "summary": "Senior JavaScript Engineer and Team Lead in the Solutions Delivery group at appendTo.",
      "highlights": [
        "Built a large, complex single-page-application for an international client. The application made heavy use of KnockoutJS with numerous custom bindings and extensions, and custom developed modules to handle client-side routing, logging and other architectural concerns, as well as Twitter Bootstrap for UI layout (grid) and components.",
        "JavaScript module development and migration as part of a responsive re-design of a client's public web site and commerce application.",
        "UX development (JavaScript (jQuery, Knockout.JS), HTML5 and CSS3) for a customer building a large-scale custom commerce application.",
        "Built several native iPad applications using HTML5, CSS3 and JavaScript (jQuery, Backbone.js) with Cordova/PhoneGap."
      ]
    },
    {
      "company": "Food Donation Connection",
      "position": "Senior Software Developer",
      "website": "http://foodtodonate.com",
      "startDate": "September 2011",
      "endDate": "December 2012",
      "keywords": ["JavaScript", "HTML5", "CSS", "jQuery", "LessCSS", "ASP.NET MVC", "NancyFx", "C#", "Hypermedia"],
      "summary": "Built data-driven web applications and backend services. Single-page JavaScript applications using Backbone.js and jQuery, with HTML5 and LESS/CSS, calling a HTTP/Hypermedia API written with the Nancy framework in C# on the server side.",
      "highlights": []
    },
    {
      "company": "Scripps Networks",
      "position": "Senior Software Developer",
      "website": "http://scrippsnetworks.com",
      "startDate": "July 2008",
      "endDate": "August 2011",
      "keywords": ["C#", "WinForms", "Silverlight", "ASP.NET MVC", "jQuery", "TSQL", "WCF", "BizTalk"],
      "summary": "Senior member of a team at Scripps Networks responsible for the development, maintenance, testing and delivery of internal customer-facing and integration software.",
      "highlights": [
        "Developed an ASP.NET MVC web application to allow users to perform batch editing of media asset metadata, calling SOAP web services on the backend.",
        "Rebuilt an existing Access application using Silverlight, WCF and SQL Server with Telerik Reporting services for the maintenance and amortization of affiliate accounting data.",
        "Maintenance and development of new modules for content accounting and billing applications using C#/WinForms and SQL Server Reporting Services.",
        "Development of BizTalk and WCF services for financial application integrations."
      ]
    },
    {
      "company": "Extreme Consulting",
      "position": "Software Developer",
      "website": "",
      "startDate": "April 2008",
      "endDate": "July 2008",
      "keywords": ["C#", "ASP.NET", "jQuery", "SQL Server", "TSQL", "Subversion"],
      "summary": "Our client was hosting an international event with various educational tracks that consisted of breakout sessions in different rooms (each with different, limited capacity) at a conference center. They needed an application that would allow attendees to register for the event and breakout sessions. I designed and created it for them.",
      "highlights": []
    },
    {
      "company": "Lexis Nexis Corporation",
      "position": "Software Developer",
      "website": "http://lexisnexis.com",
      "startDate": "June 2006",
      "endDate": "March 2008",
      "keywords": ["C#", "ASP.NET", "jQuery", "Windows Services", "SQL Server", "TSQL", "Subversion", "CruiseControl.NET", "NAnt"],
      "summary": "Member of a team at LexisNexis responsible for the development of UI functionality consuming SOAP web services rendering results of public records searches for customers.",
      "highlights": [
        "Developed an ASP.NET (C#/webforms) web UI to allow users to perform public records searches. Used jQuery to perform client side form validation and DOM manipulation.",
        "Created HTML and CSS for printable reports based on search results.",
        "Established a configuration management environment for the project using Subversion for version control and CruiseControl.NET for continuous integration, automated build and deployment.",
        "Developed a windows service to monitor database information and generate e-mail notifications to sales employees of service usage."
      ]
    },
    {
      "company": "Lighthouse Technologies, Inc",
      "position": "Software Engineer in Development and Test",
      "website": "",
      "startDate": "June 2005",
      "endDate": "June 2006",
      "keywords": ["C#", "WinForms", "SQL Server", "TSQL", "CruiseControl.NET"],
      "summary": "Member of a team at Lighthouse Technologies that developed a custom application for our client, Collins-Stewart. The client needed a custom financial analysis application designed and built from the ground up. It required the flexibility to be able to deal with the ever-changing financial forecasting and reporting data provided them by their financial data vendors, and the power to allow them to do complex dynamic computation and reporting on the financial data of publicly traded companies from around the globe.",
      "highlights": [
        "Developed all layers of several application modules, including UI, (logical) middle-tier components, data access layer components and database artifacts (tables, views, stored procedures).",
        "Created and executed manual test scenarios for several application modules."
      ]
    },
    {
      "company": "Northrop Grumman for Air Force Research Labs",
      "position": "Database Administrator and Developer",
      "website": "",
      "startDate": "January 2002",
      "endDate": "June 2005",
      "keywords": ["Oracle", "PL/SQL", "ColdFusion"],
      "summary": "Member of a team of contractors supporting the Air Force Research Labs (AFRL), I performed the following duties in support of a number of applications that allowed AFRL personnel to maintain and distribute data in support of research contract management.",
      "highlights": [
        "Performed database administration and support for Oracle databases.",
        "Provided maintenance, new development and technical support for desktop/thick-client applications written on top of an Oracle database.",
        "Extended the availability and reach of the application by rewriting the entire application from the ground up as a web application using Macromedia ColdFusion and JavaScript."
      ]
    },
    {
      "company": "Air Force Institute of Technology",
      "position": "Database Administrator and Developer",
      "website": "http://afit.edu",
      "startDate": "August 1997",
      "endDate": "December 2001",
      "keywords": ["Oracle", "PL/SQL"],
      "summary": "As a military staff member of a team at the Air Force Institute of Technology, the U.S. Air Force's graduate school for officers, I performed the following duties in support of a number of applications that allowed organization staff and faculty to maintain student education and personnel management data.",
      "highlights": [
        "Performed database administration and support for Oracle databases.",
        "Established and documented organizational configuration management processes and procedures.",
        "Provided maintenance, new development and technical support for desktop/thick-client applications written on top of Oracle databases."
      ]
    }
  ],
  "volunteer": [],
  "education": [],
  "awards": [],
  "publications": [{
    "name": "Modern Web Practices",
    "publisher": "Leanpub",
    "releaseDate": "11/01/2014",
    "website": "https://leanpub.com/modernwebpractices",
    "summary": "A book on modern web practices that I contributed a chapter to."
  }, {
    "name": "Managing your Ajax server requests with Sycamore",
    "publisher": "Me",
    "releaseDate": "01/06/2014",
    "website": "http://bob.yexley.net/manage-your-ajax-server-requests-with-sycamore/",
    "summary": "A detailed introduction and overview of using the Sycamore mixin that I wrote, which can be found on my GitHub profile."
  }, {
    "name": "Iterating over JavaScript objects",
    "publisher": "Me",
    "releaseDate": "12/18/2013",
    "website": "http://bob.yexley.net/iterating-over-javascript-objects/",
    "summary": "An article on the utility of being able to iterate over JavaScript object literals that demonstrates various methods and their pros and cons."
  }, {
    "name": "UMD: JavaScript modules that run anywhere",
    "publisher": "Me",
    "releaseDate": "12/02/2013",
    "website": "http://bob.yexley.net/umd-javascript-that-runs-anywhere/",
    "summary": "An article I wrote on how and why to use Universal Module Definition for JavaScript modules that can be used in the browser, in a node.js app, and with any kind of module loader (AMD or CommonJS)."
  }, {
    "name": "The software development conundrum: estimation",
    "publisher": "Me",
    "releaseDate": "11/21/2013",
    "website": "http://bob.yexley.net/the-software-development-conundrum-estimation/",
    "summary": "A detailed article on the challenges of estimation in software development."
  }, {
    "name": "DRY JavaScript with mixins",
    "publisher": "Me",
    "releaseDate": "11/04/2013",
    "website": "http://bob.yexley.net/dry-javascript-with-mixins/",
    "summary": "An article on the power and value of mixins in JavaScript, with use cases and code samples."
  }],
  "skills": [
    {
      "name": "Web Development",
      "level": "Advanced",
      "keywords": [
        "JavaScript",
        "HTML5",
        "CSS3",
        "ES6",
        "ES2015",
        "React",
        "Flux",
        "Backbone.js",
        "Knockout.js",
        "Webpack",
        "Grunt",
        "Gulp"
      ]
    },
    {
      "name": "Architecture and Backend",
      "level": "Intermediate",
      "keywords": [
        "REST",
        "Hypermedia",
        "node.js",
        "ExpressJS",
        "SQL",
        "NoSQL"
      ]
    },
    {
      "name": "Tools",
      "level": "Advanced",
      "keywords": [
        "Sublime Text",
        "Git",
        "GitHub",
        "Terminal",
        "Chrome/DevTools"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [{
    "name": "The Great Outdoors",
    "keywords": [
      "Hunting",
      "Fishing",
      "Camping",
      "Boating",
      "Hiking"
    ]
  }, {
    "name": "Sports",
    "keywords": [
      "Football",
      "Basketball",
      "Golf"
    ]
  }, {
    "name": "Reading",
    "keywords": [
      "The Bible",
      "Science Fiction",
      "Fantasy",
      "Techno-thriller/Spy fiction",
      "Westerns",
      "Military"
    ]
  }],
  "references": [
    {
      "name": "",
      "reference": ""
    }
  ]
}
